{
  "movies": [
    {
      "title": "Spider-Man: No Way Home",
      "image": "https://wallpapercave.com/wp/wp10415289.jpg",
      "description": "Spider-Man: No Way Home is a 2021 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Homecoming (2017) and Spider-Man: Far From Home (2019), and the 27th film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Watts and written by Chris McKenna and Erik Sommers. It stars Tom Holland as Peter Parker / Spider-Man alongside Zendaya, Benedict Cumberbatch, Jacob Batalon, Jon Favreau, Jamie Foxx, Willem Dafoe, Alfred Molina, Benedict Wong, Tony Revolori, Marisa Tomei, Andrew Garfield, and Tobey Maguire. In the film, Parker asks Dr. Stephen Strange (Cumberbatch) to use magic to make his identity as Spider-Man a secret again following its public revelation at the end of Far From Home. When the spell goes wrong because of Parker's actions, the multiverse is broken open, which allows visitors from alternate realities to enter Parker's universe.",
      "trailer": "https://youtu.be/JfVOs4VSpmA",
      "id": 1
    },
    {
      "title": "Captain America: Civil War",
      "image": "https://wallpapercave.com/wp/wp6726695.jpg",
      "description": "In 1991, the brainwashed super-soldier James Bucky Barnes is dispatched from a Hydra base in Siberia to intercept an automobile carrying a case of super-soldier serum. In the present day, approximately one year after Ultron is defeated by the Avengers in the nation of Sokovia,[a] Steve Rogers, Natasha Romanoff, Sam Wilson, and Wanda Maximoff stop Brock Rumlow from stealing a biological weapon from a lab in Lagos. Rumlow blows himself up, attempting to kill Rogers. Maximoff telekinetically diverts the explosion, accidentally destroying a nearby building and killing several Wakandan humanitarian workers in the process.",
      "trailer": "https://youtu.be/dKrVegVI0Us",
      "id": 2
    },
    {
      "title": "Black Panther Wakanda Forever",
      "image": "https://wallpapercave.com/wp/wp11988251.jpg",
      "description": "T'Challa, king of Wakanda, is dying from an unspecified terminal illness which his sister Shuri believes can be cured by the heart-shaped herb. Shuri attempts to synthetically recreate the herb after it was destroyed by Erik Killmonger,[a] but fails to do so before T'Challa dies.One year later, Wakanda is under pressure from other nations to share their vibranium, with some parties attempting to steal it by force. Queen Ramonda implores Shuri to continue her research on the herb, hoping to create a new Black Panther that will defend Wakanda, but she refuses due to her belief that the Black Panther is a figure of the past. In the Atlantic Ocean, the CIA and U.S. Navy SEALs utilize a vibranium detector to locate a potential vibranium deposit underwater. The expedition is killed by a group of blue-skinned, water-breathing superhumans led by Namor, with the CIA believing Wakanda to be responsible. Namor confronts Ramonda and Shuri, easily bypassing Wakanda's advanced security. Blaming Wakanda for the vibranium race, he gives them an ultimatum: deliver him the scientist responsible for the vibranium detector, or he will attack Wakanda.",
      "trailer": "https://youtu.be/_Z3QKkl1WyM",
      "id": 3
    },
    {
      "title": "Black Widow",
      "image": "https://wallpapercave.com/wp/wp9657305.png",
      "description": "In 1995, super soldier Alexei Shostakov and Black Widow Melina Vostokoff work as Russian undercover agents, posing as a family in Ohio with Natasha Romanoff and Yelena Belova as their daughters. They steal S.H.I.E.L.D. intel and escape to Cuba where their boss, General Dreykov, has Romanoff and Belova taken to the Red Room for training. In the following decades, Shostakov is imprisoned in Russia while Romanoff and Belova become successful, dangerous assassins. Romanoff eventually defects to S.H.I.E.L.D. after helping Clint Barton bomb Dreykov's Budapest office, which apparently kills Dreykov and his young daughter Antonia.",
      "trailer": "https://youtu.be/ybji16u608U",
      "id": 4
    },
    {
      "title": "Venom: Let There Be Carnage",
      "image": "https://wallpapercave.com/wp/wp3728049.jpg",
      "description": "In 1996, a young Cletus Kasady watches helplessly as his lover, Frances Barrison, is taken away from St. Estes Home for Unwanted Children to the Ravencroft Institute. On the way, Barrison uses her sonic scream powers to attack young police officer Patrick Mulligan. Mulligan shoots Barrison in the eye and suffers an injury to his ear due to her scream. Unbeknownst to Mulligan, who believes he killed her, Barrison is still taken to Ravencroft, where her abilities are restricted.",
      "trailer": "https://youtu.be/-FmWuCgJmxo",
      "id": 5
    },
    {
      "title": "Iron-Man",
      "image": "https://wallpapercave.com/wp/wp3405076.jpg",
      "description": "Tony Stark is a genius inventor and billionaire industrialist, who suits up in his armor of cutting-edge technology to become the super hero Iron Man. The adopted son of weapons manufacturer Howard Stark,[46] Tony inherited his family's company at a young age following his parents' death.[47] While overseeing a manufacturing plant in a foreign country, Stark was kidnapped by local terrorists. Instead of giving in to his captors' demands to build weapons for them, Stark created a powerful suit of armor for himself to escape.[48] Returning to America, Stark further upgraded the armor and put his vast resources and intellect to use for the betterment of the world as Iron Man.",
      "trailer": "https://youtu.be/8ugaeA-nMTc",
      "id": 6
    },
    {
      "title": "Ant-Man and the Wasp: Quantumania",
      "image": "https://wallpapercave.com/wp/wp11927952.jpg",
      "description": "During her days of entrapment in the Quantum Realm, Janet van Dyne encounters an exiled traveler named Kang. In the present day, after the Battle of Earth,[a] Scott Lang has become a successful memoirist and has been living happily with his girlfriend, Hope van Dyne. Scott's now-teenage daughter Cassie has become a political activist, resulting in her having a strained relationship with her father.",
      "trailer": "https://youtu.be/ZlNFpri-Y40",
      "id": 7
    },
    {
      "title": "Thor: Love and Thunder",
      "image": "https://wallpapercave.com/wp/wp8007067.jpg",
      "description": "Gorr and his daughter, Love, the last of their race, struggle in a barren desert. Despite their prayers to their god, Rapu, Love dies. The god-killing Necrosword calls to Gorr, leading him to Rapu's lush realm. After Rapu cruelly mocks and dismisses Gorr's plight, he renounces the god, causing Rapu to strangle him. The Necrosword offers itself to Gorr, who kills Rapu with it and vows to kill all gods. Gorr is granted the ability to manipulate shadows and produce monsters but is cursed with impending death and corruption under the sword's influence. After Gorr kills several gods, Thor, who has joined the Guardians of the Galaxy after the Battle of Earth,[a] learns of a distress signal from Sif. He parts ways with the team and finds an injured Sif, who warns that Gorr's next target is New Asgard. Meanwhile, Dr. Jane Foster, Thor's ex-girlfriend, has been diagnosed with stage four terminal cancer. With medical treatment proving ineffective, she travels to New Asgard hoping that Thor's hammer Mjolnir, which was previously fractured by Hela, might heal her.",
      "trailer": "https://youtu.be/Go8nTmfrQd8",
      "id": 8
    },
    {
      "title": "Shang-Chi and the Legend of the Ten Rings",
      "image": "https://wallpapercave.com/wp/wp10239965.jpg",
      "description": "Around a thousand years ago, Xu Wenwu discovers the mystical ten rings which grant godly powers including immortality. He establishes the Ten Rings organization, conquering kingdoms and toppling governments throughout history. In 1996, Wenwu searches for Ta Lo, a village said to harbor mythical beasts. He travels through a magical forest to the village entrance but is stopped by a guardian, Ying Li. The two fall in love, and when the Ta Lo villagers reject Wenwu, Li chooses to leave with him. They marry and have two children, Shang-Chi and Xialing. Wenwu abandons his organization and locks away the ten rings.",
      "trailer": "https://youtu.be/8YjFbMbfXaQ",
      "id": 9
    }
  ]
}
